# 숫자 처리 + 추적표
# 문제 구조 정리
# 입력: 숫자 2개
# 처리: 두 숫자를 더한다
# 출력: 합 출력

#      실행 줄                  a                                      b                           result                  설명
#        1         int(input("숫자1을 입력하시오: "))                                                                a에 첫 번째 숫자 저장
#        2                     a                        int(input("숫자2를 입력하시오: "))                           b에 두 번째 숫자 저장
#        3                     a                                      b                           a + b           result에 a와 b의 합 저장
#        4                     a                                      b                           a + b              a와 b의 합 출력