"""
[day8]심화문제 1. continue + 조건 조합
문제
1부터 10까지의 숫자를 반복하면서
아래 조건에 맞게 출력하는 프로그램을 작성하시오.
조건
•	짝수는 건너뛴다 (출력 ❌)
•	7이 나오면 반복 종료
•	나머지 숫자는 출력 -> ??? 출력결과가 1 3 5이려면 나머지 숫자를 출력하면 안됨
출력 결과
1
3
5
요구 사항
•	for 또는 while 사용
•	continue 사용
•	break 사용
👉 힌트 사고 흐름
1.	숫자를 하나씩 본다
2.	건너뛸 조건 먼저 확인
3.	종료 조건 확인
4.	출력
"""

# 풀이1
for a in range(1, 11, 2):
    if a == 7:
        break
    print(a, end=" ")
print()
# 풀이2
for b in range(1, 11):
    if b % 2 == 0:
        continue
    if b == 7:
        break
    print(b, end=" ")
print()
# 풀이3
c = 1
while True:
    if c == 7:
        break
    if c % 2 != 0:
        print(c, end=" ")
    c += 1
print()
# 풀이4
d = 1
while d <= 10:
    if d % 2 == 0:
        d += 1
        continue
    elif d == 7:
        break
    else:
        print(d, end=" ")
        d += 1
